; ModuleID = '/var/lib/jenkins/workspace/_prove-memlabels_prove_memlabels/superopt-tests/oopsla_tests/eqchecker_helper.c'
source_filename = "/var/lib/jenkins/workspace/_prove-memlabels_prove_memlabels/superopt-tests/oopsla_tests/eqchecker_helper.c"
target datalayout = "e-m:e-p:32:32-p270:32:32-p271:32:32-p272:64:64-f64:32:64-f80:32-n8:16:32-S128"
target triple = "i386-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i32, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [40 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [3 x i8] c"%c\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@dbgptr = dso_local local_unnamed_addr global void (i32)* @MYmydebug, align 4, !dbg !0
@dbgptr2 = dso_local local_unnamed_addr global void (i32)* @MYmydebug2, align 4, !dbg !125

; Function Attrs: noinline nounwind
define dso_local void @MYmyexit(i32 %ec) local_unnamed_addr #0 !dbg !136 {
entry:
  call void @llvm.dbg.value(metadata i32 %ec, metadata !138, metadata !DIExpression()), !dbg !139
  %call = call i32 bitcast (i32 (...)* @_exit to i32 (i32)*)(i32 %ec) #9, !dbg !140
  ret void, !dbg !141
}

declare dso_local i32 @_exit(...) local_unnamed_addr #1

; Function Attrs: noinline nounwind
define dso_local void @MYmymemset(i8* %s, i32 %c, i32 %n) local_unnamed_addr #0 !dbg !142 {

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dbgptr", scope: !2, file: !127, line: 147, type: !128, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 11.0.0 (https://github.com/bsorav/llvm-project2.git 088c616cb2ff811e68fbc2b29be278f514a01573)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !124, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/var/lib/jenkins/workspace/_prove-memlabels_prove_memlabels/superopt-tests/oopsla_tests/eqchecker_helper.c", directory: "/var/lib/jenkins/workspace/_prove-memlabels_prove_memlabels/superopt-tests/build/oopsla_tests")
!4 = !{}
!5 = !{!6, !13, !18, !21, !27, !10, !30, !34, !37, !40, !102, !105, !108, !111, !114, !117, !11, !120, !121}
!6 = !DISubprogram(name: "memset", scope: !7, file: !7, line: 60, type: !8, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!7 = !DIFile(filename: "/usr/include/string.h", directory: "")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !10, !11, !12}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!13 = !DISubprogram(name: "memcpy", scope: !7, file: !7, line: 42, type: !14, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!14 = !DISubroutineType(types: !15)
!15 = !{!10, !10, !16, !12}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!18 = !DISubprogram(name: "memcmp", scope: !7, file: !7, line: 63, type: !19, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!19 = !DISubroutineType(types: !20)
!20 = !{!11, !16, !16, !12}
!21 = !DISubprogram(name: "strcmp", scope: !7, file: !7, line: 136, type: !22, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!22 = !DISubroutineType(types: !23)
!23 = !{!11, !24, !24}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 32)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!27 = !DISubprogram(name: "strncmp", scope: !7, file: !7, line: 139, type: !28, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!28 = !DISubroutineType(types: !29)
!29 = !{!11, !24, !24, !12}
!30 = !DISubprogram(name: "malloc", scope: !31, file: !31, line: 539, type: !32, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!31 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!32 = !DISubroutineType(types: !33)
!33 = !{!10, !12}
!34 = !DISubprogram(name: "calloc", scope: !31, file: !31, line: 541, type: !35, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!35 = !DISubroutineType(types: !36)
!36 = !{!10, !12, !12}
!37 = !DISubprogram(name: "realloc", scope: !31, file: !31, line: 549, type: !38, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!38 = !DISubroutineType(types: !39)
!39 = !{!10, !10, !12}
!40 = !DISubprogram(name: "fopen", scope: !41, file: !41, line: 232, type: !42, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!41 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !24, !24}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 245, size: 1184, elements: !47)
!46 = !DIFile(filename: "/usr/include/bits/libio.h", directory: "")
!47 = !{!48, !49, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !68, !69, !70, !71, !75, !77, !79, !83, !86, !90, !91, !92, !93, !94, !97, !98}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !45, file: !46, line: 246, baseType: !11, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !45, file: !46, line: 251, baseType: !50, size: 32, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !45, file: !46, line: 252, baseType: !50, size: 32, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !45, file: !46, line: 253, baseType: !50, size: 32, offset: 96)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !45, file: !46, line: 254, baseType: !50, size: 32, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !45, file: !46, line: 255, baseType: !50, size: 32, offset: 160)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !45, file: !46, line: 256, baseType: !50, size: 32, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !45, file: !46, line: 257, baseType: !50, size: 32, offset: 224)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !45, file: !46, line: 258, baseType: !50, size: 32, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !45, file: !46, line: 260, baseType: !50, size: 32, offset: 288)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !45, file: !46, line: 261, baseType: !50, size: 32, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !45, file: !46, line: 262, baseType: !50, size: 32, offset: 352)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !45, file: !46, line: 264, baseType: !62, size: 32, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 32)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !46, line: 160, size: 96, elements: !64)
!64 = !{!65, !66, !67}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !63, file: !46, line: 161, baseType: !62, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !63, file: !46, line: 162, baseType: !44, size: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !63, file: !46, line: 166, baseType: !11, size: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !45, file: !46, line: 266, baseType: !44, size: 32, offset: 416)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !45, file: !46, line: 268, baseType: !11, size: 32, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !45, file: !46, line: 272, baseType: !11, size: 32, offset: 480)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !45, file: !46, line: 274, baseType: !72, size: 32, offset: 512)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !73, line: 140, baseType: !74)
!73 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!74 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !45, file: !46, line: 278, baseType: !76, size: 16, offset: 544)
!76 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !45, file: !46, line: 279, baseType: !78, size: 8, offset: 560)
!78 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !45, file: !46, line: 280, baseType: !80, size: 8, offset: 568)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 1)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !45, file: !46, line: 284, baseType: !84, size: 32, offset: 576)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !46, line: 154, baseType: null)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !45, file: !46, line: 293, baseType: !87, size: 64, offset: 608)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !73, line: 141, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !73, line: 55, baseType: !89)
!89 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !45, file: !46, line: 301, baseType: !10, size: 32, offset: 672)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !45, file: !46, line: 302, baseType: !10, size: 32, offset: 704)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !45, file: !46, line: 303, baseType: !10, size: 32, offset: 736)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !45, file: !46, line: 304, baseType: !10, size: 32, offset: 768)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !45, file: !46, line: 306, baseType: !95, size: 32, offset: 800)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !96, line: 46, baseType: !12)
!96 = !DIFile(filename: "llvm-project/build/lib/clang/11.0.0/include/stddef.h", directory: "/var/lib/jenkins/workspace/_prove-memlabels_prove_memlabels")
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !45, file: !46, line: 307, baseType: !11, size: 32, offset: 832)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !45, file: !46, line: 309, baseType: !99, size: 320, offset: 864)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 320, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 40)
!102 = !DISubprogram(name: "freopen", scope: !41, file: !41, line: 238, type: !103, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!103 = !DISubroutineType(types: !104)
!104 = !{!44, !24, !24, !44}
!105 = !DISubprogram(name: "fclose", scope: !41, file: !41, line: 199, type: !106, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!106 = !DISubroutineType(types: !107)
!107 = !{!11, !44}
!108 = !DISubprogram(name: "free", scope: !31, file: !31, line: 563, type: !109, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !10}
!111 = !DISubprogram(name: "rand", scope: !31, file: !31, line: 453, type: !112, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!112 = !DISubroutineType(types: !113)
!113 = !{!11}
!114 = !DISubprogram(name: "printf", scope: !41, file: !41, line: 318, type: !115, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!115 = !DISubroutineType(types: !116)
!116 = !{!11, !24, null}
!117 = !DISubprogram(name: "strerror", scope: !7, file: !7, line: 396, type: !118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!118 = !DISubroutineType(types: !119)
!119 = !{!50, !11}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 32)
!121 = !DISubprogram(name: "strtol", scope: !31, file: !31, line: 176, type: !122, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!122 = !DISubroutineType(types: !123)
!123 = !{!74, !24, !120, !11}
!124 = !{!0, !125}
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "dbgptr2", scope: !2, file: !127, line: 148, type: !128, isLocal: false, isDefinition: true)
!127 = !DIFile(filename: "oopsla_tests/eqchecker_helper.c", directory: "/var/lib/jenkins/workspace/_prove-memlabels_prove_memlabels/superopt-tests")
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !11}
!131 = !{i32 1, !"NumRegisterParameters", i32 0}
!132 = !{i32 7, !"Dwarf Version", i32 4}
!133 = !{i32 2, !"Debug Info Version", i32 3}
!134 = !{i32 1, !"wchar_size", i32 4}
!135 = !{!"clang version 11.0.0 (https://github.com/bsorav/llvm-project2.git 088c616cb2ff811e68fbc2b29be278f514a01573)"}
!136 = distinct !DISubprogram(name: "MYmyexit", scope: !127, file: !127, line: 9, type: !129, scopeLine: 10, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !137)
!137 = !{!138}
!138 = !DILocalVariable(name: "ec", arg: 1, scope: !136, file: !127, line: 9, type: !11)
!139 = !DILocation(line: 0, scope: !136)
!140 = !DILocation(line: 11, column: 3, scope: !136)
!141 = !DILocation(line: 12, column: 1, scope: !136)
!142 = distinct !DISubprogram(name: "MYmymemset", scope: !127, file: !127, line: 17, type: !143, scopeLine: 18, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !145)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !10, !11, !95}
!145 = !{!146, !147, !148}
!146 = !DILocalVariable(name: "s", arg: 1, scope: !142, file: !127, line: 17, type: !10)
!147 = !DILocalVariable(name: "c", arg: 2, scope: !142, file: !127, line: 17, type: !11)
!148 = !DILocalVariable(name: "n", arg: 3, scope: !142, file: !127, line: 17, type: !95)
!149 = !DILocation(line: 0, scope: !142)
!150 = !DILocation(line: 19, column: 3, scope: !142)
!151 = !DILocation(line: 20, column: 1, scope: !142)
